## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `aws_iam_policy.ecr`                              |
|          | `aws_lambda_alias.api_latest`                     |
|          | `aws_lambda_function.api`                         |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:31:52.563 STDOUT terraform:   ~ update in-place
15:31:52.563 STDOUT terraform: -/+ destroy and then create replacement
15:31:52.563 STDOUT terraform:  <= read (data resources)
15:31:52.563 STDOUT terraform: Terraform will perform the following actions:
15:31:52.563 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
15:31:52.563 STDOUT terraform:   # (depends on a resource or a module with changes pending)
15:31:52.563 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
15:31:52.563 STDOUT terraform:       + id            = (known after apply)
15:31:52.563 STDOUT terraform:       + json          = (known after apply)
15:31:52.563 STDOUT terraform:       + minified_json = (known after apply)
15:31:52.563 STDOUT terraform:       + statement {
15:31:52.563 STDOUT terraform:           + actions   = [
15:31:52.563 STDOUT terraform:               + "ecr:GetAuthorizationToken",
15:31:52.564 STDOUT terraform:             ]
15:31:52.564 STDOUT terraform:           + effect    = "Allow"
15:31:52.564 STDOUT terraform:           + resources = [
15:31:52.564 STDOUT terraform:               + "*",
15:31:52.564 STDOUT terraform:             ]
15:31:52.564 STDOUT terraform:           + sid       = "GetAuthorizationToken"
15:31:52.564 STDOUT terraform:         }
15:31:52.564 STDOUT terraform:       + statement {
15:31:52.564 STDOUT terraform:           + actions   = [
15:31:52.564 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
15:31:52.564 STDOUT terraform:               + "ecr:BatchGetImage",
15:31:52.564 STDOUT terraform:               + "ecr:CompleteLayerUpload",
15:31:52.564 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
15:31:52.564 STDOUT terraform:               + "ecr:InitiateLayerUpload",
15:31:52.564 STDOUT terraform:               + "ecr:PutImage",
15:31:52.564 STDOUT terraform:               + "ecr:UploadLayerPart",
15:31:52.564 STDOUT terraform:             ]
15:31:52.564 STDOUT terraform:           + effect    = "Allow"
15:31:52.564 STDOUT terraform:           + resources = [
15:31:52.564 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
15:31:52.564 STDOUT terraform:             ]
15:31:52.564 STDOUT terraform:           + sid       = "AllowPushPull"
15:31:52.564 STDOUT terraform:         }
15:31:52.564 STDOUT terraform:       + statement {
15:31:52.564 STDOUT terraform:           + actions   = [
15:31:52.564 STDOUT terraform:               + "lambda:GetAlias",
15:31:52.564 STDOUT terraform:               + "lambda:GetFunction",
15:31:52.564 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
15:31:52.564 STDOUT terraform:               + "lambda:ListAliases",
15:31:52.564 STDOUT terraform:               + "lambda:ListVersionsByFunction",
15:31:52.564 STDOUT terraform:               + "lambda:PublishVersion",
15:31:52.564 STDOUT terraform:               + "lambda:UpdateAlias",
15:31:52.564 STDOUT terraform:               + "lambda:UpdateFunctionCode",
15:31:52.564 STDOUT terraform:             ]
15:31:52.564 STDOUT terraform:           + effect    = "Allow"
15:31:52.565 STDOUT terraform:           + resources = [
15:31:52.565 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
15:31:52.565 STDOUT terraform:             ]
15:31:52.565 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
15:31:52.565 STDOUT terraform:         }
15:31:52.565 STDOUT terraform:       + statement {
15:31:52.565 STDOUT terraform:           + actions   = [
15:31:52.565 STDOUT terraform:               + "lambda:GetLayerVersion",
15:31:52.565 STDOUT terraform:             ]
15:31:52.565 STDOUT terraform:           + effect    = "Allow"
15:31:52.565 STDOUT terraform:           + resources = [
15:31:52.565 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
15:31:52.565 STDOUT terraform:             ]
15:31:52.565 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
15:31:52.565 STDOUT terraform:         }
15:31:52.565 STDOUT terraform:     }
15:31:52.565 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
15:31:52.565 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
15:31:52.565 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
15:31:52.565 STDOUT terraform:         name             = "ecr-api-lambda-access"
15:31:52.565 STDOUT terraform:       ~ policy           = jsonencode(
15:31:52.565 STDOUT terraform:             {
15:31:52.565 STDOUT terraform:               - Statement = [
15:31:52.565 STDOUT terraform:                   - {
15:31:52.565 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
15:31:52.565 STDOUT terraform:                       - Effect   = "Allow"
15:31:52.565 STDOUT terraform:                       - Resource = "*"
15:31:52.565 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
15:31:52.565 STDOUT terraform:                     },
15:31:52.565 STDOUT terraform:                   - {
15:31:52.565 STDOUT terraform:                       - Action   = [
15:31:52.565 STDOUT terraform:                           - "ecr:UploadLayerPart",
15:31:52.566 STDOUT terraform:                           - "ecr:PutImage",
15:31:52.566 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
15:31:52.566 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
15:31:52.566 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
15:31:52.566 STDOUT terraform:                           - "ecr:BatchGetImage",
15:31:52.566 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
15:31:52.566 STDOUT terraform:                         ]
15:31:52.566 STDOUT terraform:                       - Effect   = "Allow"
15:31:52.566 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
15:31:52.566 STDOUT terraform:                       - Sid      = "AllowPushPull"
15:31:52.566 STDOUT terraform:                     },
15:31:52.566 STDOUT terraform:                   - {
15:31:52.566 STDOUT terraform:                       - Action   = [
15:31:52.566 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
15:31:52.566 STDOUT terraform:                           - "lambda:UpdateAlias",
15:31:52.566 STDOUT terraform:                           - "lambda:PublishVersion",
15:31:52.566 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
15:31:52.566 STDOUT terraform:                           - "lambda:ListAliases",
15:31:52.566 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
15:31:52.566 STDOUT terraform:                           - "lambda:GetFunction",
15:31:52.566 STDOUT terraform:                           - "lambda:GetAlias",
15:31:52.566 STDOUT terraform:                         ]
15:31:52.566 STDOUT terraform:                       - Effect   = "Allow"
15:31:52.566 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
15:31:52.566 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
15:31:52.566 STDOUT terraform:                     },
15:31:52.566 STDOUT terraform:                   - {
15:31:52.566 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
15:31:52.566 STDOUT terraform:                       - Effect   = "Allow"
15:31:52.567 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
15:31:52.567 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
15:31:52.567 STDOUT terraform:                     },
15:31:52.567 STDOUT terraform:                 ]
15:31:52.567 STDOUT terraform:               - Version   = "2012-10-17"
15:31:52.567 STDOUT terraform:             }
15:31:52.567 STDOUT terraform:         ) -> (known after apply)
15:31:52.567 STDOUT terraform:         tags             = {}
15:31:52.567 STDOUT terraform:         # (7 unchanged attributes hidden)
15:31:52.567 STDOUT terraform:     }
15:31:52.567 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
15:31:52.567 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
15:31:52.567 STDOUT terraform:       ~ function_version = "1724" -> (known after apply)
15:31:52.567 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
15:31:52.567 STDOUT terraform:         name             = "latest"
15:31:52.567 STDOUT terraform:         # (5 unchanged attributes hidden)
15:31:52.567 STDOUT terraform:     }
15:31:52.567 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
15:31:52.567 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
15:31:52.567 STDOUT terraform:         id                             = "api-lambda"
15:31:52.567 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1724" -> (known after apply)
15:31:52.567 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1724/invocations" -> (known after apply)
15:31:52.567 STDOUT terraform:         tags                           = {}
15:31:52.567 STDOUT terraform:       ~ version                        = "1724" -> (known after apply)
15:31:52.567 STDOUT terraform:         # (27 unchanged attributes hidden)
15:31:52.567 STDOUT terraform:       ~ environment {
15:31:52.567 STDOUT terraform:           ~ variables = {
15:31:52.568 STDOUT terraform:               ~ "NEW_RELIC_APP_NAME"                    = "notification-api-staging" -> "notification-lambda-api-staging"
15:31:52.568 STDOUT terraform:                 # (18 unchanged elements hidden)
15:31:52.568 STDOUT terraform:             }
15:31:52.568 STDOUT terraform:         }
15:31:52.568 STDOUT terraform:         # (4 unchanged blocks hidden)
15:31:52.568 STDOUT terraform:     }
15:31:52.568 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
15:31:52.568 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
15:31:52.568 STDOUT terraform:       ~ id       = "4366688015600654907" -> (known after apply)
15:31:52.568 STDOUT terraform:       ~ triggers = { # forces replacement
15:31:52.568 STDOUT terraform:           ~ "always_run" = "2025-09-22T15:03:59Z" -> (known after apply)
15:31:52.568 STDOUT terraform:         }
15:31:52.568 STDOUT terraform:     }
15:31:52.568 STDOUT terraform: Plan: 1 to add, 3 to change, 1 to destroy.
15:31:52.568 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
15:31:52.568 STDOUT terraform: Saved the plan to: plan.tfplan
15:31:52.568 STDOUT terraform: To perform exactly these actions, run the following command to apply:
15:31:52.568 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
